/* 实验1
练习1：兔子生崽问题。假设一对小兔的成熟期是一个月，
即一个月可长成成兔，每对成兔每个月可以生一对小兔，一对新生的小兔从第二个月起就开始生兔子，
试问从一对兔子开始繁殖，一年以后可有多少对兔子？（月前月末都可） */

//1 2 3 4 5 6 7 8 9 10 11 12
//1 1 2 3 5 8 13 21 34 55 89 144


#include <stdio.h>
 
int main()
{
    int f1 = 1, f2 = 1;
    int f3; // f3表示第n个月的兔子对数
    int n;
    
    printf("第1个月：%d对兔子\n", f1);
    printf("第2个月：%d对兔子\n", f2);
    for (n = 3; n <= 12; n++)
    {
        f3 = f1 + f2;
        printf("第%d个月：%d对兔子\n", n, f3);
        f1 = f2;
        f2 = f3;
    }
    printf("一年后共有%d对兔子\n", f3);
    return 0;
}